b3chain/b3chain/contrib/miner/b3miner-firmware/sdkconfig.defaults
# B3Miner-1 defaults — tune per board spin
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Ethernet (RMII to LAN8720A)
CONFIG_ETH_USE_SPI_ETHERNET=n
CONFIG_ETH_USE_ESP32_EMAC=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# TLS for Stratum (V1 stratum+ssl / future V2)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# HTTP server + WebSocket dashboard
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# OTA — enable signed images in production (see b3_ota/README.md)
# CONFIG_SECURE_BOOT=y
# CONFIG_SECURE_SIGNED_APPS_SCHEME_RSA_3072=y

# Log level (override in menuconfig for field debug)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
